CSI API ETABS v1
cFrameObj.AddByPoint Method
 Adds a new frame object whose end points are specified by name.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int AddByPoint(
	string Point1,
	string Point2,
	ref string Name,
	string PropName = "Default",
	string UserName = ""
)
Function AddByPoint (
	Point1 As String,
	Point2 As String,
	ByRef Name As String,
	Optional PropName As String = "Default",
	Optional UserName As String = ""
) As Integer
Dim instance As cFrameObj
Dim Point1 As String
Dim Point2 As String
Dim Name As String
Dim PropName As String
Dim UserName As String
Dim returnValue As Integer
returnValue = instance.AddByPoint(Point1,
	Point2, Name, PropName, UserName)
int AddByPoint(
	String^ Point1,
	String^ Point2,
	String^% Name,
	String^ PropName = L"Default",
	String^ UserName = L""
)
abstract AddByPoint :
        Point1 : string *
        Point2 : string *
        Name : string byref *
        ?PropName : string *
        ?UserName : string
(* Defaults:
        let _PropName = defaultArg PropName "Default"
        let _UserName = defaultArg UserName ""
*)
-> int
Parameters
Point1
Type: System.String
 The name of a defined point object at the I-End of the added frame object.
Point2
Type: System.String
 The name of a defined point object at the J-End of the added frame object.
Name
Type: System.String
 This is the name that the program ultimately assigns for the frame object. If no UserName is specified, the program assigns a default name to the frame object. If a UserName is specified and that name is not used for another frame, cable or tendon object, the UserName is assigned to the frame object, otherwise a default name is assigned to the frame object.
PropName (Optional)
Type: System.String
 This is Default, None, or the name of a defined frame section property.
 If it is Default, the program assigns a default section property to the frame object. If it is None, no section property is assigned to the frame object. If it is the name of a defined frame section property, that property is assigned to the frame object.
UserName (Optional)
Type: System.String
 This is an optional user specified name for the frame object. If a UserName is specified and that name is already used for another frame object, the program ignores the UserName.
Return Value
Type: Int32
 Returns zero if the frame object is successfully added, otherwise it returns a nonzero value.
Remarks
 Note that the End I and End J joints of the added frame object are determined based on the orientation of the object and may not be the same order as specified in the parameters of this API functions. Please use GetPoints(String, String, String) to check the position of the End I and End J joints.
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Name As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'add frame object by points
   ret = SapModel.FrameObj.AddByPoint("1", "6", Name)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace